import UIKit

// Задание 1
// Написать функцию, которая определяет, четное число или нет:

func testOne(a: Int) -> Bool {
    if a % 2 == 0  {
    print("Число четное")
    return true
    }
    print("Число не четное")
    return false
    }

// Задание 2
// Написать функцию, которая определяет, делится ли число без остатка на 3:

func testTwo(a: Int) -> Bool {
    if a % 3 == 0  {
    print("Число делится на 3 без остатка")
    return true
    }
    print("Число НЕ делится на 3 без остатка")
    return false
    }

// Задание 3
// Создать возрастающий массив из 100 чисел:

var array: Array<Int> = []
for i in 1...100 {
    array.append(i)
    }
print(array)

// Задание 4
// Удалить из этого массива все четные числа и все числа, которые не делятся на 3:

// создал функцию для сортировки к заданию:

func sorted4(a: [Int]) -> [Int] {
    var data = a
// создаю локальный массив
    var array2: Array<Int> = []
    for i in data {
    if i % 2 != 0, i % 3 == 0 {
// добавляю отсортированные по заданию числа
        array2.append(i)
        }
    }
    data.removeAll()
    data = array2
    return data
    }
// перезаписываем наш массив
// вызываем функцию, аргументом указываем наш массив
array = sorted4(a: array)
print(array)

// Задание 5
// Написать функцию, которая добавляет в массив новое число Фибоначчи, и добавить при помощи нее 50 элементов:

// новый пустой массив
var arrayFn: Array<Int> = []

// функция для добавления чисел Фибоначчи в массив
 func fiboAppend() {
// первые 2 числа фибоначи для вычисления последующих
      let fn1 = 1,  fn2 = 1
      arrayFn.append(fn1)
      arrayFn.append(fn2)
// буферный массив
     var a: Array<Int> = []
     for _ in 1...50 {
          a = arrayFn.suffix(2)
          arrayFn.append(a[0] + a[1])
         }
      }
// вызов функции и принт
fiboAppend()
print(arrayFn)
 
// Задание 6
/*
 Заполнить массив из 100 элементов различными простыми числами. Натуральное число, большее единицы, называется простым, если оно делится только на себя и на единицу. Для нахождения всех простых чисел не больше заданного числа n, следуя методу Эратосфена, нужно выполнить следующие шаги:

a. Выписать подряд все целые числа от двух до n (2, 3, 4, ..., n).
b. Пусть переменная p изначально равна двум — первому простому числу.
c. Зачеркнуть в списке числа от 2 + p до n, считая шагом p..
d. Найти первое не зачёркнутое число в списке, большее, чем p, и присвоить значению переменной p это число.
e. Повторять шаги c и d, пока возможно.
*/

var array6: Array<Int> = []
// выписываем подряд целые числа от 2
for i in 2...100 {
    array6.append(i)
}
print(array6)

var a = 0
var p = 2

for i in array6 {
  for (index, _) in array6.enumerated() {
      a = index + p
      if a < array6.endIndex {
          array6.remove(at: a)
      } else {
        break
      }
  }
  if i > p {
    p == i
  }
}
print(array6)


